{
  "header": {
    "projects": "Проекти",
    "skills": "Навички",
    "jobs": "Досвід",
    "contacts": "Контакти"
  },
  "projects": {
    "myProjectsH": "Мої проекти",
    "futureProjectsH": "Потенційні проекти",
    "myProjectsTitle": "FellowshipTweets",
    "futureProjectsTitleId1": "E-sports",
    "futureProjectsTitleId2": "MovieRate",
    "myProjectsDescription": "Невеличке завдання, яке переросло в міні твітер з всесвіту Володаря перстнів. Мета завдання було створити функціональну компоненту, яку можна використовувати для відображень публікацій типу твітера",
    "futureProjectsDescriptionId1": "Односторінковий інтернет магазин ігрових крісел, є вже готовий макет в Figma, сам проект буде розроблятися в найближчий час",
    "futureProjectsDescriptionId2": "Мій власний проект, ідея його для перегляду рейтингу фільмів від популярних кінокритиків і не тільки, проект на даний момент в не найкращому стані, розроблятиметься у вільний час після проекту E-sports"
  },
  "projectDetails": {
    "title": "FellowshipTweets",
    "description": "Невелике завдання для освоєння компонентів в React, яке переросло в міні проект FellowshipTweets. Головною метою було створити компоненту у вигляді посту з твітера або фейсбука. В проекті було використано 2 компоненти, одна на пост інша на юзера, окрім React-у додаткових бібліотек не було використано. Після реалізації компоненти засвітилась ідея, чому б не зробити міні твітер з всесвіту Володаря перснів, результат можна побачити за посиланням.",
    "link": "FellowshipTweets"
  },
  "skills": {
    "header": "Мої Навички",
    "descriptionHtml": "Впевнений рівень веб-розробки з використанням HTM",
    "descriptionCss": "Досвід розробки стильового дизайну на CSS",
    "descriptionJs": "Розуміння та досвід програмування на JavaScript",
    "descriptionReact": "Хороший рівень розробки веб-додатків з використанням бібліотеки React",
    "descriptionNpm": "Достатній рівень роботи з npm у веб-розробці",
    "descriptionSql": "Основні знання та досвід використання мови SQL для управління реляційними базами даних",
    "descriptionWebpack": "Достатній рівень використання Webpack для збору та оптимізації веб-додатків",
    "descriptionRedux": "Достатній рівень використання Redux для керування станом додатків у веб-розробці",
    "descriptionBootstrap": "Базовий рівень використання фреймворку Bootstrap для створення сучасних та адаптивних веб-інтерфейсів"
  },
  "jobs": {
    "experienceH": "Досвід роботи",
    "experienceTitle": "Front-End Розробник (Очікувана)",
    "experienceDescription": "Початок: 2023 (Очікується). Планую займатися розробкою веб-додатків та створенням візуально привабливих інтерфейсів",
    "educationH": "Освіта",
    "educationTitle1": "Бакалавр, Інформаційні системи та технологі",
    "educationDescription1": "ЛНУ імені Івана Франка, 2020 - дотепер. Основні предмети: алгоритми, програмування, бази даних",
    "educationTitle2": "JavaScript : Занурення",
    "educationDescription2": "WayUp, початок/кінець: 2021. Безкоштовний курс з базовими уроками по JS",
    "educationTitle3": "Основи HTML/CSS",
    "educationDescription3": "GoIT, початок/кінець: 2022. Безкоштовний демо курс з основами HTML/CSS",
    "educationTitle4": "Front-End Advanced",
    "educationDescription4": "Cursor, початок/кінець: 2023. Онлайн курс з поглибленим вивченням javascript та інших фреймворків/бібліотек"
  },
  "contacts": {
    "name": "Олег Ярош",
    "description": "Веб-розробник-ентузіаст, який завжди готовий вивчати нові технології та робити веб-програми більш інтерактивними.",
    "number": "Робочий номер: +380682886168",
    "email": "Робоча пошта:"
  }
}
